; domain
(define (domain exploration)
    (:requirements :strips :typing :equality :action-costs)
    
    (:types
        robot location - object
    )
    
    (:predicates
        (at ?r - robot ?l - location)
        (explored ?l - location)
        (adjacent ?l1 - location ?l2 - location)
        (can-traverse ?r - robot ?l - location)
        (can-observe ?r - robot ?l - location)
    )
    
    (:functions
        (total-cost)
        (traverse-cost ?r - robot ?l - location)
    )
    
    (:action move
        :parameters (?r - robot ?from - location ?to - location)
        :precondition (and
            (at ?r ?from)
            (adjacent ?from ?to)
            (can-traverse ?r ?to)
        )
        :effect (and
            (not (at ?r ?from))
            (at ?r ?to)
            (increase (total-cost) (traverse-cost ?r ?to))
        )
    )
    
    (:action observe
        :parameters (?r - robot ?l - location)
        :precondition (and
            (at ?r ?l)
            (can-observe ?r ?l)
        )
        :effect (explored ?l)
    )
)

; problem
(define (problem exploration-generated)
    (:domain exploration)
    
    (:objects
        B G - robot
        l11 l12 l13 l14 l15 l21 l22 l23 l24
        l25 l31 l32 l33 l34 l35 l41 l42 l43
        l44 l45 l51 l52 l53 l54 l55 - location
    )
    
    (:init
        ;; Robot starting positions
        (at B l11)
        (at G l11)

        ;; Traversability and costs
        (can-traverse B l11)
        (= (traverse-cost B l11) 1)
        (can-traverse G l11)
        (= (traverse-cost G l11) 1)
        (can-traverse B l12)
        (= (traverse-cost B l12) 1)
        (can-traverse B l13)
        (= (traverse-cost B l13) 1)
        (can-traverse G l13)
        (= (traverse-cost G l13) 1)
        (can-traverse B l14)
        (= (traverse-cost B l14) 1)
        (can-traverse G l14)
        (= (traverse-cost G l14) 1)
        (can-traverse B l15)
        (= (traverse-cost B l15) 1)
        (can-traverse G l15)
        (= (traverse-cost G l15) 1)
        (can-traverse B l21)
        (= (traverse-cost B l21) 1)
        (can-traverse G l21)
        (= (traverse-cost G l21) 1)
        (can-traverse B l22)
        (= (traverse-cost B l22) 5)
        (can-traverse G l22)
        (= (traverse-cost G l22) 5)
        (can-traverse B l23)
        (= (traverse-cost B l23) 1)
        (can-traverse G l23)
        (= (traverse-cost G l23) 1)
        (can-traverse B l24)
        (= (traverse-cost B l24) 1)
        (can-traverse G l24)
        (= (traverse-cost G l24) 1)
        (can-traverse B l25)
        (= (traverse-cost B l25) 1)
        (can-traverse G l25)
        (= (traverse-cost G l25) 1)
        (can-traverse B l31)
        (= (traverse-cost B l31) 1)
        (can-traverse G l31)
        (= (traverse-cost G l31) 1)
        (can-traverse B l32)
        (= (traverse-cost B l32) 1)
        (can-traverse G l32)
        (= (traverse-cost G l32) 1)
        (can-traverse B l33)
        (= (traverse-cost B l33) 1)
        (can-traverse G l33)
        (= (traverse-cost G l33) 1)
        (can-traverse B l34)
        (= (traverse-cost B l34) 1)
        (can-traverse G l34)
        (= (traverse-cost G l34) 1)
        (can-traverse B l35)
        (= (traverse-cost B l35) 1)
        (can-traverse G l35)
        (= (traverse-cost G l35) 1)
        (can-traverse B l41)
        (= (traverse-cost B l41) 1)
        (can-traverse G l41)
        (= (traverse-cost G l41) 1)
        (can-traverse B l42)
        (= (traverse-cost B l42) 1)
        (can-traverse G l42)
        (= (traverse-cost G l42) 1)
        (can-traverse B l43)
        (= (traverse-cost B l43) 1)
        (can-traverse G l43)
        (= (traverse-cost G l43) 1)
        (can-traverse B l44)
        (= (traverse-cost B l44) 1)
        (can-traverse G l44)
        (= (traverse-cost G l44) 1)
        (can-traverse B l45)
        (= (traverse-cost B l45) 1)
        (can-traverse G l45)
        (= (traverse-cost G l45) 1)
        (can-traverse B l51)
        (= (traverse-cost B l51) 1)
        (can-traverse G l51)
        (= (traverse-cost G l51) 1)
        (can-traverse B l52)
        (= (traverse-cost B l52) 1)
        (can-traverse G l52)
        (= (traverse-cost G l52) 1)
        (can-traverse B l53)
        (= (traverse-cost B l53) 1)
        (can-traverse G l53)
        (= (traverse-cost G l53) 1)
        (can-traverse B l54)
        (= (traverse-cost B l54) 1)
        (can-traverse G l54)
        (= (traverse-cost G l54) 1)
        (can-traverse B l55)
        (= (traverse-cost B l55) 1)
        (can-traverse G l55)
        (= (traverse-cost G l55) 1)

        ;; Observation capabilities
        (can-observe B l11)
        (can-observe G l11)
        (can-observe B l12)
        (can-observe G l12)
        (can-observe B l13)
        (can-observe G l13)
        (can-observe B l14)
        (can-observe G l14)
        (can-observe B l15)
        (can-observe G l15)
        (can-observe B l21)
        (can-observe G l21)
        (can-observe B l22)
        (can-observe G l22)
        (can-observe B l23)
        (can-observe G l23)
        (can-observe B l24)
        (can-observe G l24)
        (can-observe B l25)
        (can-observe G l25)
        (can-observe B l31)
        (can-observe G l31)
        (can-observe B l32)
        (can-observe G l32)
        (can-observe B l33)
        (can-observe G l33)
        (can-observe B l34)
        (can-observe G l34)
        (can-observe B l35)
        (can-observe G l35)
        (can-observe B l41)
        (can-observe G l41)
        (can-observe B l42)
        (can-observe G l42)
        (can-observe B l43)
        (can-observe G l43)
        (can-observe B l44)
        (can-observe G l44)
        (can-observe B l45)
        (can-observe G l45)
        (can-observe B l51)
        (can-observe G l51)
        (can-observe B l52)
        (can-observe G l52)
        (can-observe B l53)
        (can-observe G l53)
        (can-observe B l54)
        (can-observe G l54)
        (can-observe B l55)
        (can-observe G l55)

        ;; Grid adjacency
        (adjacent l11 l12) (adjacent l12 l11)
        (adjacent l11 l21) (adjacent l21 l11)
        (adjacent l12 l13) (adjacent l13 l12)
        (adjacent l12 l22) (adjacent l22 l12)
        (adjacent l13 l14) (adjacent l14 l13)
        (adjacent l13 l23) (adjacent l23 l13)
        (adjacent l14 l15) (adjacent l15 l14)
        (adjacent l14 l24) (adjacent l24 l14)
        (adjacent l15 l25) (adjacent l25 l15)
        (adjacent l21 l22) (adjacent l22 l21)
        (adjacent l21 l31) (adjacent l31 l21)
        (adjacent l22 l23) (adjacent l23 l22)
        (adjacent l22 l32) (adjacent l32 l22)
        (adjacent l23 l24) (adjacent l24 l23)
        (adjacent l23 l33) (adjacent l33 l23)
        (adjacent l24 l25) (adjacent l25 l24)
        (adjacent l24 l34) (adjacent l34 l24)
        (adjacent l25 l35) (adjacent l35 l25)
        (adjacent l31 l32) (adjacent l32 l31)
        (adjacent l31 l41) (adjacent l41 l31)
        (adjacent l32 l33) (adjacent l33 l32)
        (adjacent l32 l42) (adjacent l42 l32)
        (adjacent l33 l34) (adjacent l34 l33)
        (adjacent l33 l43) (adjacent l43 l33)
        (adjacent l34 l35) (adjacent l35 l34)
        (adjacent l34 l44) (adjacent l44 l34)
        (adjacent l35 l45) (adjacent l45 l35)
        (adjacent l41 l42) (adjacent l42 l41)
        (adjacent l41 l51) (adjacent l51 l41)
        (adjacent l42 l43) (adjacent l43 l42)
        (adjacent l42 l52) (adjacent l52 l42)
        (adjacent l43 l44) (adjacent l44 l43)
        (adjacent l43 l53) (adjacent l53 l43)
        (adjacent l44 l45) (adjacent l45 l44)
        (adjacent l44 l54) (adjacent l54 l44)
        (adjacent l45 l55) (adjacent l55 l45)
        (adjacent l51 l52) (adjacent l52 l51)
        (adjacent l52 l53) (adjacent l53 l52)
        (adjacent l53 l54) (adjacent l54 l53)
        (adjacent l54 l55) (adjacent l55 l54)

        (= (total-cost) 0)
    )
    
    (:goal (and
        ;; All locations explored
        (explored l11) (explored l12) (explored l13) (explored l14) (explored l15)
        (explored l21) (explored l22) (explored l23) (explored l24) (explored l25)
        (explored l31) (explored l32) (explored l33) (explored l34) (explored l35)
        (explored l41) (explored l42) (explored l43) (explored l44) (explored l45)
        (explored l51) (explored l52) (explored l53) (explored l54) (explored l55)
        ;; Robot goal positions
        (at B l55)
        (at G l55)
    ))
    
    (:metric minimize (total-cost))
)

; plan
1. (move g l11 l21)
   deleted: (at g l11)
   added: (at g l21)
   goals met: 0 of 27
2. (move g l21 l22)
   deleted: (at g l21)
   added: (at g l22)
   goals met: 0 of 27
3. (move b l11 l12)
   deleted: (at b l11)
   added: (at b l12)
   goals met: 0 of 27
4. (observe g l22)
   added: (explored l22)
   goals met: 1 of 27
5. (move g l22 l23)
   deleted: (at g l22)
   added: (at g l23)
   goals met: 1 of 27
6. (observe g l23)
   added: (explored l23)
   goals met: 2 of 27
7. (observe b l12)
   added: (explored l12)
   goals met: 3 of 27
8. (move g l23 l33)
   deleted: (at g l23)
   added: (at g l33)
   goals met: 3 of 27
9. (move b l12 l11)
   deleted: (at b l12)
   added: (at b l11)
   goals met: 3 of 27
10. (observe g l33)
   added: (explored l33)
   goals met: 4 of 27
11. (move g l33 l43)
   deleted: (at g l33)
   added: (at g l43)
   goals met: 4 of 27
12. (observe g l43)
   added: (explored l43)
   goals met: 5 of 27
13. (move g l43 l44)
   deleted: (at g l43)
   added: (at g l44)
   goals met: 5 of 27
14. (observe g l44)
   added: (explored l44)
   goals met: 6 of 27
15. (move g l44 l54)
   deleted: (at g l44)
   added: (at g l54)
   goals met: 6 of 27
16. (move b l11 l21)
   deleted: (at b l11)
   added: (at b l21)
   goals met: 6 of 27
17. (observe b l21)
   added: (explored l21)
   goals met: 7 of 27
18. (move b l21 l11)
   deleted: (at b l21)
   added: (at b l11)
   goals met: 7 of 27
19. (observe b l11)
   added: (explored l11)
   goals met: 8 of 27
20. (move b l11 l12)
   deleted: (at b l11)
   added: (at b l12)
   goals met: 8 of 27
21. (move b l12 l13)
   deleted: (at b l12)
   added: (at b l13)
   goals met: 8 of 27
22. (observe b l13)
   added: (explored l13)
   goals met: 9 of 27
23. (move b l13 l14)
   deleted: (at b l13)
   added: (at b l14)
   goals met: 9 of 27
24. (observe b l14)
   added: (explored l14)
   goals met: 10 of 27
25. (move g l54 l55)
   deleted: (at g l54)
   added: (at g l55)
   goals met: 11 of 27
26. (move b l14 l15)
   deleted: (at b l14)
   added: (at b l15)
   goals met: 11 of 27
27. (observe b l15)
   added: (explored l15)
   goals met: 12 of 27
28. (move b l15 l25)
   deleted: (at b l15)
   added: (at b l25)
   goals met: 12 of 27
29. (observe b l25)
   added: (explored l25)
   goals met: 13 of 27
30. (move b l25 l24)
   deleted: (at b l25)
   added: (at b l24)
   goals met: 13 of 27
31. (observe b l24)
   added: (explored l24)
   goals met: 14 of 27
32. (move b l24 l34)
   deleted: (at b l24)
   added: (at b l34)
   goals met: 14 of 27
33. (observe b l34)
   added: (explored l34)
   goals met: 15 of 27
34. (move b l34 l35)
   deleted: (at b l34)
   added: (at b l35)
   goals met: 15 of 27
35. (observe b l35)
   added: (explored l35)
   goals met: 16 of 27
36. (move b l35 l45)
   deleted: (at b l35)
   added: (at b l45)
   goals met: 16 of 27
37. (move b l45 l44)
   deleted: (at b l45)
   added: (at b l44)
   goals met: 16 of 27
38. (move b l44 l43)
   deleted: (at b l44)
   added: (at b l43)
   goals met: 16 of 27
39. (move b l43 l42)
   deleted: (at b l43)
   added: (at b l42)
   goals met: 16 of 27
40. (observe b l42)
   added: (explored l42)
   goals met: 17 of 27
41. (move b l42 l32)
   deleted: (at b l42)
   added: (at b l32)
   goals met: 17 of 27
42. (observe b l32)
   added: (explored l32)
   goals met: 18 of 27
43. (move b l32 l31)
   deleted: (at b l32)
   added: (at b l31)
   goals met: 18 of 27
44. (observe b l31)
   added: (explored l31)
   goals met: 19 of 27
45. (move b l31 l41)
   deleted: (at b l31)
   added: (at b l41)
   goals met: 19 of 27
46. (observe b l41)
   added: (explored l41)
   goals met: 20 of 27
47. (move b l41 l51)
   deleted: (at b l41)
   added: (at b l51)
   goals met: 20 of 27
48. (observe b l51)
   added: (explored l51)
   goals met: 21 of 27
49. (move b l51 l52)
   deleted: (at b l51)
   added: (at b l52)
   goals met: 21 of 27
50. (observe b l52)
   added: (explored l52)
   goals met: 22 of 27
51. (move b l52 l53)
   deleted: (at b l52)
   added: (at b l53)
   goals met: 22 of 27
52. (observe b l53)
   added: (explored l53)
   goals met: 23 of 27
53. (move b l53 l54)
   deleted: (at b l53)
   added: (at b l54)
   goals met: 23 of 27
54. (observe b l54)
   added: (explored l54)
   goals met: 24 of 27
55. (move b l54 l55)
   deleted: (at b l54)
   added: (at b l55)
   goals met: 25 of 27
56. (move g l55 l45)
   deleted: (at g l55)
   added: (at g l45)
   goals met: 24 of 27
57. (observe g l45)
   added: (explored l45)
   goals met: 25 of 27
58. (move g l45 l55)
   deleted: (at g l45)
   added: (at g l55)
   goals met: 26 of 27
59. (observe g l55)
   added: (explored l55)
   goals met: 27 of 27
